// Задача 2: Задайте строку, содержащую латинские буквы в обоих регистрах. 
// Сформируйте строку, в которой все заглавные буквы заменены на строчные.

string str = "asdDAWDsadWdSdwWAsddWDAs";
System.Console.WriteLine(str);
string result = str.ToLower();
Console.WriteLine(result);